# Agregaciones en pandas

In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline

In [12]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})

In [13]:
df

  key1 key2     data1     data2
0    a  one  0.562899 -0.580829
1    a  two  0.709872  0.513877
2    b  one  1.391612 -0.398324
3    b  two  0.141044  0.277102
4    a  one -2.181792  0.141074

In [14]:
df['data1'].groupby(df['key1'])

In [15]:
df['data1'].groupby(df['key1']).mean()

key1
a   -0.303007
b    0.766328
Name: data1, dtype: float64

In [16]:
df.groupby(df['key1']).mean()

         data1     data2
key1
a    -0.303007  0.024707
b     0.766328 -0.060611

In [17]:
df.groupby(['key1', 'key2']).max()

              data1     data2
key1 key2
a    one   0.562899  0.141074
     two   0.709872  0.513877
b    one   1.391612 -0.398324
     two   0.141044  0.277102

In [18]:
df.groupby(['key1', 'key2']).max().unstack()

         data1               data2
key2       one       two       one       two
key1
a     0.562899  0.709872  0.141074  0.513877
b     1.391612  0.141044 -0.398324  0.277102

In [19]:
for key, group in df.groupby('key1'):
    print(key, group)
    print('-' * 50)

a   key1 key2     data1     data2
0    a  one  0.562899 -0.580829
1    a  two  0.709872  0.513877
4    a  one -2.181792  0.141074
--------------------------------------------------
b   key1 key2     data1     data2
2    b  one  1.391612 -0.398324
3    b  two  0.141044  0.277102
--------------------------------------------------

In [22]:
for (key1, key2), group in df.groupby(['key1', 'key2']):
    print(key1, key2, group)
    print('-' * 50)

a one   key1 key2     data1     data2
0    a  one  0.562899 -0.580829
4    a  one -2.181792  0.141074
--------------------------------------------------
a two   key1 key2     data1     data2
1    a  two  0.709872  0.513877
--------------------------------------------------
b one   key1 key2     data1     data2
2    b  one  1.391612 -0.398324
--------------------------------------------------
b two   key1 key2     data1     data2
3    b  two  0.141044  0.277102
--------------------------------------------------

In [24]:
d = dict(list(df.groupby('key1')))
d['a']

  key1 key2     data1     data2
0    a  one  0.562899 -0.580829
1    a  two  0.709872  0.513877
4    a  one -2.181792  0.141074

In [25]:
data_grouped = df.groupby('key1')

In [28]:
data_grouped['data1'].quantile(.1)

key1
a   -1.632854
b    0.266101
Name: data1, dtype: float64

In [29]:
def range_min_max(a):
    return a.max() - a.min()

data_grouped.agg(range_min_max)

         data1     data2
key1
a     2.891664  1.094706
b     1.250569  0.675426

In [30]:
df

  key1 key2     data1     data2
0    a  one  0.562899 -0.580829
1    a  two  0.709872  0.513877
2    b  one  1.391612 -0.398324
3    b  two  0.141044  0.277102
4    a  one -2.181792  0.141074

### Ejemplo ponderación

In [33]:
def weighted_mean(a):
    weights = np.array([.5, .4, .1])
    b = a * weights[:a.size]
    return b.sum()

In [34]:
df.groupby('key1').agg(weighted_mean)

         data1     data2
key1
a     0.347219 -0.070757
b     0.752224 -0.088321

In [35]:
df.groupby('key1', as_index=False).mean()

  key1     data1     data2
0    a -0.303007  0.024707
1    b  0.766328 -0.060611

In [37]:
df.groupby(['key1', 'key2'], as_index=False).mean()

  key1 key2     data1     data2
0    a  one -0.809446 -0.219878
1    a  two  0.709872  0.513877
2    b  one  1.391612 -0.398324
3    b  two  0.141044  0.277102

In [39]:
df.groupby(['key1', 'key2'], as_index=False).mean().drop('key1', axis=1)

  key2     data1     data2
0  one -0.809446 -0.219878
1  two  0.709872  0.513877
2  one  1.391612 -0.398324
3  two  0.141044  0.277102

# Time series

In [41]:
from datetime import datetime

In [44]:
now = datetime.now()
now

datetime.datetime(2019, 1, 11, 18, 39, 24, 648646)

In [45]:
now.hour

18

In [46]:
now.day

11

In [47]:
now.microsecond

648646

In [48]:
from datetime import timedelta

In [49]:
start = datetime(2019, 1, 11)

In [50]:
start + timedelta(12)

datetime.datetime(2019, 1, 23, 0, 0)

In [51]:
start - timedelta(12)

datetime.datetime(2018, 12, 30, 0, 0)

In [52]:
start + timedelta(365)

datetime.datetime(2020, 1, 11, 0, 0)

In [55]:
start.strftime('%Y-%m-%d')

'2019-01-11'

In [56]:
import dateutil

In [58]:
dateutil.parser.parse('2019-01-11')

datetime.datetime(2019, 1, 11, 0, 0)

In [59]:
dateutil.parser.parse('11/1/2019')

datetime.datetime(2019, 11, 1, 0, 0)

In [60]:
dateutil.parser.parse('11/1/2019', dayfirst=True)

datetime.datetime(2019, 1, 11, 0, 0)

In [80]:
dates = [datetime(2011, 1, 2), datetime(2011, 1, 5),
         datetime(2011, 1, 7), datetime(2011, 1, 8),
         datetime(2011, 1, 10), datetime(2011, 1, 12),
         datetime(2011, 8, 1)]
ts = pd.Series(np.random.randn(7), index=dates)
ts

2011-01-02    0.266260
2011-01-05   -1.200234
2011-01-07   -0.830535
2011-01-08    0.347977
2011-01-10   -0.142787
2011-01-12   -1.333619
2011-08-01   -1.227938
dtype: float64

In [81]:
ts.index

DatetimeIndex(['2011-01-02', '2011-01-05', '2011-01-07', '2011-01-08',
               '2011-01-10', '2011-01-12', '2011-08-01'],
              dtype='datetime64[ns]', freq=None)

In [82]:
ts.index[::2]

DatetimeIndex(['2011-01-02', '2011-01-07', '2011-01-10', '2011-08-01'], dtype='datetime64[ns]', freq=None)

In [83]:
ts + ts[::2]

2011-01-02    0.532519
2011-01-05         NaN
2011-01-07   -1.661069
2011-01-08         NaN
2011-01-10   -0.285574
2011-01-12         NaN
2011-08-01   -2.455875
dtype: float64

In [84]:
ts.index[2]

Timestamp('2011-01-07 00:00:00')

In [85]:
ts

2011-01-02    0.266260
2011-01-05   -1.200234
2011-01-07   -0.830535
2011-01-08    0.347977
2011-01-10   -0.142787
2011-01-12   -1.333619
2011-08-01   -1.227938
dtype: float64

In [86]:
ts['1/10/2011']

-0.1427871748672251

In [87]:
ts['20110110']

-0.1427871748672251

In [90]:
ts['20110108':]

2011-01-08    0.347977
2011-01-10   -0.142787
2011-01-12   -1.333619
2011-08-01   -1.227938
dtype: float64

In [91]:
ventas = [1, 2, 3, 2, 1, 2, 1, 2, 2, 3, 2, 1]

In [92]:
pd.date_range('2019-1-1', periods=len(ventas) + 1)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12',
               '2019-01-13'],
              dtype='datetime64[ns]', freq='D')

In [96]:
ts_ventas = pd.Series(ventas, index=pd.date_range('2019-1-1', periods=len(ventas)))

In [97]:
ts_ventas['2019-1-1':'2019-1-7'].mean()

1.7142857142857142

In [98]:
ts_ventas.index[0].weekday()

1

In [99]:
df_ventas = pd.DataFrame({'ventas':ts_ventas})

In [100]:
df_ventas

            ventas
2019-01-01       1
2019-01-02       2
2019-01-03       3
2019-01-04       2
2019-01-05       1
2019-01-06       2
2019-01-07       1
2019-01-08       2
2019-01-09       2
2019-01-10       3
2019-01-11       2
2019-01-12       1

In [103]:
df_ventas['workday'] = df_ventas.index.weekday < 5

In [104]:
df_ventas

            ventas  workday
2019-01-01       1     True
2019-01-02       2     True
2019-01-03       3     True
2019-01-04       2     True
2019-01-05       1    False
2019-01-06       2    False
2019-01-07       1     True
2019-01-08       2     True
2019-01-09       2     True
2019-01-10       3     True
2019-01-11       2     True
2019-01-12       1    False

In [105]:
df_ventas[['workday']].applymap(lambda x: 'Laborable' if x else 'Finde')

              workday
2019-01-01  Laborable
2019-01-02  Laborable
2019-01-03  Laborable
2019-01-04  Laborable
2019-01-05      Finde
2019-01-06      Finde
2019-01-07  Laborable
2019-01-08  Laborable
2019-01-09  Laborable
2019-01-10  Laborable
2019-01-11  Laborable
2019-01-12      Finde

In [106]:
pd.date_range('2012-04-01', '2012-06-01')

DatetimeIndex(['2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
               '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
               '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
               '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
               '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20',
               '2012-04-21', '2012-04-22', '2012-04-23', '2012-04-24',
               '2012-04-25', '2012-04-26', '2012-04-27', '2012-04-28',
               '2012-04-29', '2012-04-30', '2012-05-01', '2012-05-02',
               '2012-05-03', '2012-05-04', '2012-05-05', '2012-05-06',
               '2012-05-07', '2012-05-08', '2012-05-09', '2012-05-10',
               '2012-05-11', '2012-05-12', '2012-05-13', '2012-05-14',
               '2012-05-15', '2012-05-16', '2012-05-17', '2012-05-18',
               '2012-05-19', '2012-05-20', '2012-05-21', '2012-05-22',
               '2012-05-23', '2012-05-24', '2012-05-25', '2012-05-26',
               '2012-05-27', '2012-05-28', '2012-05-29', '2012-05-30',
               '2012-05-31', '2012-06-01'],
              dtype='datetime64[ns]', freq='D')

In [108]:
pd.date_range('2012-04-01', '2012-06-01', periods=20)

DatetimeIndex([          '2012-04-01 00:00:00',
               '2012-04-04 05:03:09.473684224',
               '2012-04-07 10:06:18.947368448',
               '2012-04-10 15:09:28.421052672',
               '2012-04-13 20:12:37.894736896',
               '2012-04-17 01:15:47.368421120',
               '2012-04-20 06:18:56.842105344',
               '2012-04-23 11:22:06.315789568',
               '2012-04-26 16:25:15.789473792',
               '2012-04-29 21:28:25.263158016',
               '2012-05-03 02:31:34.736841984',
               '2012-05-06 07:34:44.210526208',
               '2012-05-09 12:37:53.684210432',
               '2012-05-12 17:41:03.157894656',
               '2012-05-15 22:44:12.631578880',
               '2012-05-19 03:47:22.105263104',
               '2012-05-22 08:50:31.578947328',
               '2012-05-25 13:53:41.052631552',
               '2012-05-28 18:56:50.526315776',
                         '2012-06-01 00:00:00'],
              dtype='datetime64[ns]', freq=None)

In [109]:
pd.date_range(start='2012-04-01', periods=20)

DatetimeIndex(['2012-04-01', '2012-04-02', '2012-04-03', '2012-04-04',
               '2012-04-05', '2012-04-06', '2012-04-07', '2012-04-08',
               '2012-04-09', '2012-04-10', '2012-04-11', '2012-04-12',
               '2012-04-13', '2012-04-14', '2012-04-15', '2012-04-16',
               '2012-04-17', '2012-04-18', '2012-04-19', '2012-04-20'],
              dtype='datetime64[ns]', freq='D')

In [110]:
pd.date_range(end='2012-06-01', periods=20)

DatetimeIndex(['2012-05-13', '2012-05-14', '2012-05-15', '2012-05-16',
               '2012-05-17', '2012-05-18', '2012-05-19', '2012-05-20',
               '2012-05-21', '2012-05-22', '2012-05-23', '2012-05-24',
               '2012-05-25', '2012-05-26', '2012-05-27', '2012-05-28',
               '2012-05-29', '2012-05-30', '2012-05-31', '2012-06-01'],
              dtype='datetime64[ns]', freq='D')

In [112]:
pd.date_range(end='2012-06-01', periods=20, freq='BM')

DatetimeIndex(['2010-10-29', '2010-11-30', '2010-12-31', '2011-01-31',
               '2011-02-28', '2011-03-31', '2011-04-29', '2011-05-31',
               '2011-06-30', '2011-07-29', '2011-08-31', '2011-09-30',
               '2011-10-31', '2011-11-30', '2011-12-30', '2012-01-31',
               '2012-02-29', '2012-03-30', '2012-04-30', '2012-05-31'],
              dtype='datetime64[ns]', freq='BM')

In [113]:
pd.date_range(end='2012-06-01 12:57:34', periods=10, freq='1h31min')

DatetimeIndex(['2012-05-31 23:18:34', '2012-06-01 00:49:34',
               '2012-06-01 02:20:34', '2012-06-01 03:51:34',
               '2012-06-01 05:22:34', '2012-06-01 06:53:34',
               '2012-06-01 08:24:34', '2012-06-01 09:55:34',
               '2012-06-01 11:26:34', '2012-06-01 12:57:34'],
              dtype='datetime64[ns]', freq='91T')

In [114]:
pd.date_range(end='2012-06-01 12:57:34', periods=10, freq='T')

DatetimeIndex(['2012-06-01 12:48:34', '2012-06-01 12:49:34',
               '2012-06-01 12:50:34', '2012-06-01 12:51:34',
               '2012-06-01 12:52:34', '2012-06-01 12:53:34',
               '2012-06-01 12:54:34', '2012-06-01 12:55:34',
               '2012-06-01 12:56:34', '2012-06-01 12:57:34'],
              dtype='datetime64[ns]', freq='T')

In [115]:
import pytz
pytz.common_timezones

['Africa/Abidjan', 'Africa/Accra', 'Africa/Addis_Ababa', 'Africa/Algiers', 'Africa/Asmara', 'Africa/Bamako', 'Africa/Bangui', 'Africa/Banjul', 'Africa/Bissau', 'Africa/Blantyre', 'Africa/Brazzaville', 'Africa/Bujumbura', 'Africa/Cairo', 'Africa/Casablanca', 'Africa/Ceuta', 'Africa/Conakry', 'Africa/Dakar', 'Africa/Dar_es_Salaam', 'Africa/Djibouti', 'Africa/Douala', 'Africa/El_Aaiun', 'Africa/Freetown', 'Africa/Gaborone', 'Africa/Harare', 'Africa/Johannesburg', 'Africa/Juba', 'Africa/Kampala', 'Africa/Khartoum', 'Africa/Kigali', 'Africa/Kinshasa', 'Africa/Lagos', 'Africa/Libreville', 'Africa/Lome', 'Africa/Luanda', 'Africa/Lubumbashi', 'Africa/Lusaka', 'Africa/Malabo', 'Africa/Maputo', 'Africa/Maseru', 'Africa/Mbabane', 'Africa/Mogadishu', 'Africa/Monrovia', 'Africa/Nairobi', 'Africa/Ndjamena', 'Africa/Niamey', 'Africa/Nouakchott', 'Africa/Ouagadougou', 'Africa/Porto-Novo', 'Africa/Sao_Tome', 'Africa/Tripoli', 'Africa/Tunis', 'Africa/Windhoek', 'America/Adak', 'America/Anchorage', 'America/Anguilla', 'America/Antigua', 'America/Araguaina', 'America/Argentina/Buenos_Aires', 'America/Argentina/Catamarca', 'America/Argentina/Cordoba', 'America/Argentina/Jujuy', 'America/Argentina/La_Rioja', 'America/Argentina/Mendoza', 'America/Argentina/Rio_Gallegos', 'America/Argentina/Salta', 'America/Argentina/San_Juan', 'America/Argentina/San_Luis', 'America/Argentina/Tucuman', 'America/Argentina/Ushuaia', 'America/Aruba', 'America/Asuncion', 'America/Atikokan', 'America/Bahia', 'America/Bahia_Banderas', 'America/Barbados', 'America/Belem', 'America/Belize', 'America/Blanc-Sablon', 'America/Boa_Vista', 'America/Bogota', 'America/Boise', 'America/Cambridge_Bay', 'America/Campo_Grande', 'America/Cancun', 'America/Caracas', 'America/Cayenne', 'America/Cayman', 'America/Chicago', 'America/Chihuahua', 'America/Costa_Rica', 'America/Creston', 'America/Cuiaba', 'America/Curacao', 'America/Danmarkshavn', 'America/Dawson', 'America/Dawson_Creek', 'America/Denver', 'America/Detroit', 'America/Dominica', 'America/Edmonton', 'America/Eirunepe', 'America/El_Salvador', 'America/Fort_Nelson', 'America/Fortaleza', 'America/Glace_Bay', 'America/Godthab', 'America/Goose_Bay', 'America/Grand_Turk', 'America/Grenada', 'America/Guadeloupe', 'America/Guatemala', 'America/Guayaquil', 'America/Guyana', 'America/Halifax', 'America/Havana', 'America/Hermosillo', 'America/Indiana/Indianapolis', 'America/Indiana/Knox', 'America/Indiana/Marengo', 'America/Indiana/Petersburg', 'America/Indiana/Tell_City', 'America/Indiana/Vevay', 'America/Indiana/Vincennes', 'America/Indiana/Winamac', 'America/Inuvik', 'America/Iqaluit', 'America/Jamaica', 'America/Juneau', 'America/Kentucky/Louisville', 'America/Kentucky/Monticello', 'America/Kralendijk', 'America/La_Paz', 'America/Lima', 'America/Los_Angeles', 'America/Lower_Princes', 'America/Maceio', 'America/Managua', 'America/Manaus', 'America/Marigot', 'America/Martinique', 'America/Matamoros', 'America/Mazatlan', 'America/Menominee', 'America/Merida', 'America/Metlakatla', 'America/Mexico_City', 'America/Miquelon', 'America/Moncton', 'America/Monterrey', 'America/Montevideo', 'America/Montserrat', 'America/Nassau', 'America/New_York', 'America/Nipigon', 'America/Nome', 'America/Noronha', 'America/North_Dakota/Beulah', 'America/North_Dakota/Center', 'America/North_Dakota/New_Salem', 'America/Ojinaga', 'America/Panama', 'America/Pangnirtung', 'America/Paramaribo', 'America/Phoenix', 'America/Port-au-Prince', 'America/Port_of_Spain', 'America/Porto_Velho', 'America/Puerto_Rico', 'America/Punta_Arenas', 'America/Rainy_River', 'America/Rankin_Inlet', 'America/Recife', 'America/Regina', 'America/Resolute', 'America/Rio_Branco', 'America/Santarem', 'America/Santiago', 'America/Santo_Domingo', 'America/Sao_Paulo', 'America/Scoresbysund', 'America/Sitka', 'America/St_Barthelemy', 'America/St_Johns', 'America/St_Kitts', 'America/St_Lucia', 'America/St_Thomas', 'America/St_Vincent', 'America/Swift_Current', 'America/Tegucigalpa', 'America/Thule', 'America/Thunder_Bay', 'America/Tijuana', 'America/Toronto', 'America/Tortola', 'America/Vancouver', 'America/Whitehorse', 'America/Winnipeg', 'America/Yakutat', 'America/Yellowknife', 'Antarctica/Casey', 'Antarctica/Davis', 'Antarctica/DumontDUrville', 'Antarctica/Macquarie', 'Antarctica/Mawson', 'Antarctica/McMurdo', 'Antarctica/Palmer', 'Antarctica/Rothera', 'Antarctica/Syowa', 'Antarctica/Troll', 'Antarctica/Vostok', 'Arctic/Longyearbyen', 'Asia/Aden', 'Asia/Almaty', 'Asia/Amman', 'Asia/Anadyr', 'Asia/Aqtau', 'Asia/Aqtobe', 'Asia/Ashgabat', 'Asia/Atyrau', 'Asia/Baghdad', 'Asia/Bahrain', 'Asia/Baku', 'Asia/Bangkok', 'Asia/Barnaul', 'Asia/Beirut', 'Asia/Bishkek', 'Asia/Brunei', 'Asia/Chita', 'Asia/Choibalsan', 'Asia/Colombo', 'Asia/Damascus', 'Asia/Dhaka', 'Asia/Dili', 'Asia/Dubai', 'Asia/Dushanbe', 'Asia/Famagusta', 'Asia/Gaza', 'Asia/Hebron', 'Asia/Ho_Chi_Minh', 'Asia/Hong_Kong', 'Asia/Hovd', 'Asia/Irkutsk', 'Asia/Jakarta', 'Asia/Jayapura', 'Asia/Jerusalem', 'Asia/Kabul', 'Asia/Kamchatka', 'Asia/Karachi', 'Asia/Kathmandu', 'Asia/Khandyga', 'Asia/Kolkata', 'Asia/Krasnoyarsk', 'Asia/Kuala_Lumpur', 'Asia/Kuching', 'Asia/Kuwait', 'Asia/Macau', 'Asia/Magadan', 'Asia/Makassar', 'Asia/Manila', 'Asia/Muscat', 'Asia/Nicosia', 'Asia/Novokuznetsk', 'Asia/Novosibirsk', 'Asia/Omsk', 'Asia/Oral', 'Asia/Phnom_Penh', 'Asia/Pontianak', 'Asia/Pyongyang', 'Asia/Qatar', 'Asia/Qyzylorda', 'Asia/Riyadh', 'Asia/Sakhalin', 'Asia/Samarkand', 'Asia/Seoul', 'Asia/Shanghai', 'Asia/Singapore', 'Asia/Srednekolymsk', 'Asia/Taipei', 'Asia/Tashkent', 'Asia/Tbilisi', 'Asia/Tehran', 'Asia/Thimphu', 'Asia/Tokyo', 'Asia/Tomsk', 'Asia/Ulaanbaatar', 'Asia/Urumqi', 'Asia/Ust-Nera', 'Asia/Vientiane', 'Asia/Vladivostok', 'Asia/Yakutsk', 'Asia/Yangon', 'Asia/Yekaterinburg', 'Asia/Yerevan', 'Atlantic/Azores', 'Atlantic/Bermuda', 'Atlantic/Canary', 'Atlantic/Cape_Verde', 'Atlantic/Faroe', 'Atlantic/Madeira', 'Atlantic/Reykjavik', 'Atlantic/South_Georgia', 'Atlantic/St_Helena', 'Atlantic/Stanley', 'Australia/Adelaide', 'Australia/Brisbane', 'Australia/Broken_Hill', 'Australia/Currie', 'Australia/Darwin', 'Australia/Eucla', 'Australia/Hobart', 'Australia/Lindeman', 'Australia/Lord_Howe', 'Australia/Melbourne', 'Australia/Perth', 'Australia/Sydney', 'Canada/Atlantic', 'Canada/Central', 'Canada/Eastern', 'Canada/Mountain', 'Canada/Newfoundland', 'Canada/Pacific', 'Europe/Amsterdam', 'Europe/Andorra', 'Europe/Astrakhan', 'Europe/Athens', 'Europe/Belgrade', 'Europe/Berlin', 'Europe/Bratislava', 'Europe/Brussels', 'Europe/Bucharest', 'Europe/Budapest', 'Europe/Busingen', 'Europe/Chisinau', 'Europe/Copenhagen', 'Europe/Dublin', 'Europe/Gibraltar', 'Europe/Guernsey', 'Europe/Helsinki', 'Europe/Isle_of_Man', 'Europe/Istanbul', 'Europe/Jersey', 'Europe/Kaliningrad', 'Europe/Kiev', 'Europe/Kirov', 'Europe/Lisbon', 'Europe/Ljubljana', 'Europe/London', 'Europe/Luxembourg', 'Europe/Madrid', 'Europe/Malta', 'Europe/Mariehamn', 'Europe/Minsk', 'Europe/Monaco', 'Europe/Moscow', 'Europe/Oslo', 'Europe/Paris', 'Europe/Podgorica', 'Europe/Prague', 'Europe/Riga', 'Europe/Rome', 'Europe/Samara', 'Europe/San_Marino', 'Europe/Sarajevo', 'Europe/Saratov', 'Europe/Simferopol', 'Europe/Skopje', 'Europe/Sofia', 'Europe/Stockholm', 'Europe/Tallinn', 'Europe/Tirane', 'Europe/Ulyanovsk', 'Europe/Uzhgorod', 'Europe/Vaduz', 'Europe/Vatican', 'Europe/Vienna', 'Europe/Vilnius', 'Europe/Volgograd', 'Europe/Warsaw', 'Europe/Zagreb', 'Europe/Zaporozhye', 'Europe/Zurich', 'GMT', 'Indian/Antananarivo', 'Indian/Chagos', 'Indian/Christmas', 'Indian/Cocos', 'Indian/Comoro', 'Indian/Kerguelen', 'Indian/Mahe', 'Indian/Maldives', 'Indian/Mauritius', 'Indian/Mayotte', 'Indian/Reunion', 'Pacific/Apia', 'Pacific/Auckland', 'Pacific/Bougainville', 'Pacific/Chatham', 'Pacific/Chuuk', 'Pacific/Easter', 'Pacific/Efate', 'Pacific/Enderbury', 'Pacific/Fakaofo', 'Pacific/Fiji', 'Pacific/Funafuti', 'Pacific/Galapagos', 'Pacific/Gambier', 'Pacific/Guadalcanal', 'Pacific/Guam', 'Pacific/Honolulu', 'Pacific/Kiritimati', 'Pacific/Kosrae', 'Pacific/Kwajalein', 'Pacific/Majuro', 'Pacific/Marquesas', 'Pacific/Midway', 'Pacific/Nauru', 'Pacific/Niue', 'Pacific/Norfolk', 'Pacific/Noumea', 'Pacific/Pago_Pago', 'Pacific/Palau', 'Pacific/Pitcairn', 'Pacific/Pohnpei', 'Pacific/Port_Moresby', 'Pacific/Rarotonga', 'Pacific/Saipan', 'Pacific/Tahiti', 'Pacific/Tarawa', 'Pacific/Tongatapu', 'Pacific/Wake', 'Pacific/Wallis', 'US/Alaska', 'US/Arizona', 'US/Central', 'US/Eastern', 'US/Hawaii', 'US/Mountain', 'US/Pacific', 'UTC']